/*
**. Напишите программу, которая на вход принимает значение, 
а на выходе показывает обратное значение.
1 -> 1 
2 -> 0.5
0.25 -> 4

*/

System.Console.WriteLine("Введите значение: ");
    double value = Convert.ToDouble(Console.ReadLine());

System.Console.WriteLine( 1 / value);

