/*
Задача 3. Напишите программу вычисления функции:
 x = f(a)

*/


Console.WriteLine("Введите число 'a':  ");
int a = Convert.ToInt32(Console.ReadLine());

int x;
x = a*a;

System.Console.WriteLine($" f(a) = {x} ");
